#version: 0.2
Ġ Ġ
ĠĠ ĠĠ
ĠĠ Ġ
Ċ ĠĠĠĠ
e r
o n
i n
r e
a t
ĠĠĠĠ ĠĠĠĠ
o r
s t
s e
Ġ =
e n
Ċ ĠĠĠ
ĊĠĠĠĠ ĠĠĠ
Ġ t
l e
a l
a r
i on
d e
a n
c t
i t
Ġ c
) ;
e t
r o
ĠĠĠĠ ĠĠĠ
Ġ {
a m
i c
Ġ p
ĊĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġ f
i s
e s
i m
u r
h e
u t
ĊĠĠĠĠ ĠĠĠĠĠĠĠ
Ġ "
a s
Ġ re
ĉ ĉ
in g
en t
Ġ n
Ġ }
( )
Ġ *
at e
Ġ '
- -
u n
i d
i f
l o
e x
Ġ (
u e
g et
Ġ s
or t
c e
e d
a d
l f
se lf
o m
a g
Ġ m
u l
Ġ in
a p
p ort
am e
t r
i l
e l
ur n
p e
Ġ o
Ġ b
Ġ d
Ġt he
t urn
Ġ v
a c
Ċ Ġ
o l
s er
' ,
i g
p t
i st
o t
im port
o de
/ /
u b
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
a b
" ,
u m
* *
h is
Ċ ĊĠĠĠ
ct ion
Ċ ĉ
Ġ if
at ion
Ċ ĉĉ
r i
ĊĠĠĠĠ Ġ
e w
c h
Ġre turn
l ic
Ġ w
Ġ self
e m
se t
at a
Ġ S
an d
( "
Ġ a
a y
Ġ de
ag e
= =
Ġ st
I n
y pe
as s
ex t
on t
-- --
Ġ +
e st
Ġ l
( '
in t
e ct
i le
u p
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
# #
q u
o d
v er
pt ion
) :
Ġ T
re s
Ġt his
ub lic
Ġt o
Ġ @
ul t
tr ing
Ġf or
p l
l ass
( );
ro m
h t
i z
t h
Ġ C
v e
t er
es s
al ue
Ġ #
ab le
t o
) )
Ġ A
d er
c k
Ġ <
p er
c on
R e
_ _
n ame
ac k
m ent
Ġ [
Ċ ĊĠĠĠĠĠĠĠ
Ġ is
j ect
at h
p ut
ar am
' )
ĊĠĠĠĠ ĠĠĠĠ
un ction
Ġc on
u s
Ġn ew
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
en d
k e
c o
p ro
ul l
E x
" )
Ġo f
Ġde f
Ġ -
Ġ L
" :
a in
o w
al l
on e
or m
an g
er s
Ġ or
Ġ //
a se
S t
" "
Ġp ublic
i r
p o
Ġ e
ad d
Ċ Ċ
Ġ g
Ġ r
it h
Ġ as
a v
] ,
im e
ser t
n t
Ġ h
a ct
st r
l i
Ġ ex
Ġt r
ar g
ar t
Ġ P
Ġ j
o o
q ue
Ġ N
Ġc om
c om
ap p
p on
b ject
' :
o ut
Ġre s
it y
Ġ :
r or
N ame
Ġ get
Ġ= =
Ġ and
Ġt h
i re
) ,
iz e
I d
d ata
lo g
ode l
---- ----
Ġ /
S tring
Ġ* /
f ig
č Ċ
** **
in e
Ġ el
o ur
ĊĠĠĠĠĠĠĠĠ Ġ
Ġ D
al se
## ##
o p
o c
Ġ M
Ġ u
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġ F
) .
P ro
Ġ O
ig ht
i v
Ġp ro
ic e
ro w
== ==
t e
s c
ke y
in d
que st
L ist
Ġ I
[ '
an ce
de f
a x
at ch
ce ption
i al
un t
p aram
p le
O N
s ion
t his
i el
Ġn ot
a re
Ġf unction
iel d
in al
f orm
Ġn ull
ĠS tring
Ġ i
C on
" );
f f
= "
Ġ _
o s
re ate
v ent
de x
a ce
. _
T ype
f o
. .
E R
ri v
i ew
o id
i b
r ay
Ġ se
t ype
' ]
v al
or d
Ġ B
Ċĉĉ ĉĉ
u re
Ġv ar
Ġ R
Ġel se
Ex ception
f rom
riv ate
or y
s h
Ġst at
Ċĉĉ ĉ
a ult
() .
T r
en se
c lass
an s
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġd ata
Ġ import
Ġv oid
I N
Ġb e
p r
Ġ" ""
c ess
Ġf rom
ess age
a il
re turn
f ile
Ġ} ,
p s
C ont
v ice
Ġin t
p ath
Ġ set
en g
u le
u il
our ce
at or
Ġ on
it ion
en er
i es
Ġ .
qu al
un d
um ent
pon se
Ċ ĊĠ
Ġc lass
Ġ it
R es
a st
Ġ y
Ġw ith
d ate
T o
av a
Ġor g
c ont
r it
Ġ !
c ode
Ġv alue
et h
b er
le ment
lo ad
l l
i p
m o
arg s
g er
i ve
s on
p ublic
D ata
D e
Ġn ame
Ġstat ic
t y
Ġf inal
Ġ )
ut il
Ġ un
eng th
Ġc ont
v ar
Ġt est
ang e
E S
t est
č ĊĠĠĠĠĠĠĠ
č ĊĠĠĠ
c l
E n
v alue
Ġp rivate
o g
le ct
qu ire
ar d
T I
Ġ= >
an t
Ċ ĠĠ
er y
ac he
li ent
Ġas sert
E N
or k
Ġ x
t em
ig n
he ck
S er
c ol
ab el
C om
Ġ U
ic ense
C h
p re
u st
er ror
= '
Ġf ile
Ġ an
A r
ro up
ĠN one
b o
f t
le t
< /
E r
st ance
s s
Ġ W
eth od
Ġst r
l ist
u g
Ġ G
lo w
Ġcon st
Ġc h
Ġ $
Er ror
V alue
ht t
o re
lo c
ur re
ut h
Ġw h
S e
Ġ &
res s
Ġ} );
m l
a w
] )
i o
Ġ/ **
Ġtr ue
() );
n ew
Ġt ype
o b
in k
ur l
as k
u ser
f unction
O R
A R
Ġj ava
ĠL icense
an n
le an
lo ck
i x
g r
ut e
' );
l y
Ġp r
T est
Ġ >
re ad
pe ct
) );
Ġf alse
k en
#### ####
i ct
Ġs h
um ber
urre nt
Ġ im
**** ****
Ġ |
e c
ption s
y n
p ar
e y
Ġres ult
V iew
č Ċĉ
u ct
app end
m odel
I D
il l
==== ====
on g
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġb y
s ize
p y
() ,
A T
C ol
l ength
Ġ id
as sert
ri de
-------- --------
o st
Ġ H
O bject
ar get
od ule
sc ri
K ey
ar y
] .
Ġu se
ĠĠĠĠ Ġ
ation s
S T
i se
i de
ad er
Ġ In
" ;
ĠT he
pon ent
a ve
oo lean
u se
Ġ at
} ,
as h
O ver
l ay
r y
en ce
L E
pe c
per ty
b ack
Tr ue
p ack
o ck
= {
re f
Ġ& &
po s
tr ib
ate d
Ġo ut
a k
F ield
y le
Ġ %
() )
: //
M ap
u d
am ple
il ter
n d
[ "
st at
Ġc ol
E qual
F ile
Ġ he
uil der
S E
e b
Ġ! =
S et
ing s
Ġl ist
c reate
s p
Ġ key
B y
Ġ E
R E
' ;
Ġth row
T ext
Ġv al
Ġ `
r ame
( {
t on
re d
w ork
m in
Ġu ser
Ġre quire
Ġ al
Over ride
in dex
t ext
co unt
Ġ log
n e
con st
ow n
Ġpr int
A N
up date
Ġ __
ĊĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
e p
ut ton
u es
A L
ap i
Re quest
m a
Ġth at
in it
I T
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠ
St ate
it le
um n
id th
con fig
T ime
/ **
s o
ac h
ar ray
o unt
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġ V
ar ch
an ag
I tem
Ġdef ault
re am
A d
Ġ k
qu ery
Ġ en
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
C lass
Con fig
Ġn p
r ap
d iv
" ]
Ġ J
htt p
m and
if i
Ġm odel
a ction
it em
Ġ< /
S c
f or
N ode
o u
t ime
y st
am es
m ap
w ord
m s
] ;
ce pt
l er
u ff
rit e
I m
oc ument
E lement
if ic
g e
Ser vice
Ġp aram
Ġ ()
pr int
form at
p es
yst em
ĠT r
b e
il d
pl ay
a it
o f
Ġre quest
ex port
Ġ add
i a
A t
Ar ray
ers ion
o ul
Ġs c
l ine
č ĊĠĠĠĠĠĠĠĠĠĠĠ
co re
g le
U T
c es
op y
E vent
oul d
Ġ ro
yn c
f er
lo at
st ate
se s
Ġ| |
n ode
od y
A p
d ir
le ction
str ing
( (
s ub
[ ]
ã ģ
U ser
re e
de d
Q u
ap e
in put
} ;
u c
Ġ= ==
A S
w w
uil d
E D
// //
it e
M essage
anag er
P ath
o und
res ult
Ġc reate
Ġs er
Ġ ?
t il
are nt
ag es
in fo
o int
g ist
er e
if y
st art
Ġ+ =
ar k
Cont ext
Ġp ath
Ġ Re
Ġd o
Ġtr y
TI ON
e e
D E
pack age
p h
o in
val id
ro ll
m ax
Ġs up
In fo
Ġp ar
"" "
a le
P aram
ind ow
Ġo bject
m on
Ġb oolean
Ġ} ;
Ġo b
A M
I C
y s
e at
er m
po int
Ġex pect
j son
ur ation
v iew
ht ml
Ġcon fig
mo ve
oo k
R O
N one
Ġa re
.. /
all back
Ġin put
or s
U til
o bject
U n
Ġ ext
Ġt ime
A C
j s
d is
ir st
c ord
N ot
ic k
arg ument
d ict
d b
and ler
en s
lic k
U R
Ġun der
et a
e ight
lo t
C ode
St at
B uilder
Ġn ode
r c
m at
( [
n um
l ink
l abel
n ot
m e
" >
L og
Ġo s
In dex
+ +
a uth
c ur
Ġ );
le te
Ġn um
Ġ all
ire ct
Ġ error
lo b
ter n
v el
O f
n er
b y
F orm
lo se
') .
ĠTr ue
Ġ le
er r
r ight
im it
ri b
Ġd ist
Ġ- >
M odel
Ġc ase
De f
ĠL ist
Ġ{ }
T h
c lient
Ġres ponse
Res ponse
__ (
p en
re quest
at es
e vent
D ate
) {
t ot
ain er
r aw
end s
Ġp l
he d
Ġs ub
oo gle
ä ¸
or g
scri ption
Ġm ethod
Ċ Ċĉ
Ġd is
def ault
w are
() :
Ġ} )
n et
Ġl en
ial iz
Ġ app
Ċĉĉĉĉ ĉĉ
e qual
a ke
F alse
pl it
Ġit em
act ory
tr y
G roup
tr ans
ate g
pl ate
re n
M anager
č Ċĉĉ
uff er
et er
ro id
Ġst art
Ġt ext
w rite
Ġs pec
Ġthrow s
I S
re ak
} );
U p
ar n
Ġ( !
ap ache
O r
trib ute
f ield
ann el
er t
pl ace
/ *
ic s
b ase
V al
a ise
Ġp re
ic es
ĠĠĠĠ ĠĠ
ut ion
Ġ ac
.. .
id er
so le
IN G
t ings
m odule
and le
f rame
w ait
ĠC on
stat us
Ġm essage
Ġ let
Res ult
te ger
and om
or der
u al
Ġm ax
con d
c urrent
et urn
Ġc heck
m essage
int er
] [
Ġe vent
ne ction
B e
par se
us h
******** ********
ĠA r
c heck
S h
Qu ery
g roup
. /
es c
######## ########
E T
Ġ[ ]
") .
ol der
y pes
Ġin dex
is sion
et ers
Ġout put
S ize
Ġf ield
j oin
f ind
Pro perty
A s
A n
i e
Ġst ate
pl i
o ol
ĠF alse
ĠP ro
Ġ args
Ċĉĉĉĉ ĉ
loc al
d f
A c
o ver
om e
ĠO bject
čĊ č
m b
Ġc urrent
In put
ass word
htt ps
ment s
en c
') ,
Ġ \
======== ========
Ġc an
pt y
str uct
Ġ ent
Ġ z
w ith
Ġin stance
se d
l d
h er
per t
im age
t t
q l
tr ue
en sion
ub le
Ġ em
L ay
u de
li b
in ed
lic ation
f ace
ect ed
g oogle
n ull
f l
assert Equal
ust om
l en
Ġ url
param s
List ener
Ad d
le d
ann ot
Ġs o
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
cont ent
Ġp os
pert ies
co pe
Ġc l
lay er
ver sion
rit er
d uct
Ġsup er
bo x
out put
m p
A G
Ġw ill
B utton
en u
L e
P ar
Ġex cept
s um
Ġ K
Ġ[ '
cont ext
Ġm ay
Ġn o
' ],
N ull
pro to
a f
C lient
ol d
Ġt arget
EN T
p rivate
C O
Ġ end
' '
Ġr ange
A P
res ponse
i able
In stance
Ġex p
St ream
d at
at ive
} )
o k
Ċ ĊĠĠĠĠĠ
util s
ption al
ver t
t arget
In t
Ġcont ext
ri pt
at tr
ut ed
s g
Ġh as
he ma
in stance
Ġtr ans
L O
un c
it s
ĠA p
Ġy ou
Ġ lo
Ġdist rib
Tr ans
O n
Ġw e
Ġo ptions
Ġa wait
u f
Ġc opy
S ON
se nt
ï ¼
ĠT his
ug in
Cont ent
nt ity
el l
l ang
O ut
W ith
A ct
se lect
en v
f ilter
m ethod
b ug
Ġin it
r un
Ġ update
ob j
ut o
uc cess
r l
th er
Stat us
pl y
o x
Ap p
it or
w eb
T able
Ġc atch
I L
ĠO R
U L
w args
ser v
A ction
Col or
lob al
s w
ro und
A D
Se lect
A B
Ġl ine
L oc
m it
C ount
Ġn umber
re g
Ġclass Name
n p
") ,
m d
Ġ{ @
ft ware
---------------- ----------------
. __
ag s
t itle
s plit
Ġel if
c re
n o
t able
Ġl abel
F or
S I
a int
S ub
Ġstr ing
to ken
P os
Ġb reak
Ġext ends
ad ata
D I
F actory
sh ape
o ptions
it er
D esc
m et
to p
C H
Ġa ct
able d
ro l
Ġd ocument
O T
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
rap h
ĠA N
Ġe lement
Ġ ]
u res
Ġ Y
b r
a z
Ġr aise
H andler
re move
c ent
Ġ ab
am p
ib le
iv ity
ut es
ĠU n
tr ain
ã Ĥ
c s
u i
t es
st yle
Ġr un
ic h
pro cess
" ))
t he
G et
gist er
Ġsh ould
Ġ* *
il en
Ġt em
E ntity
$ {
A ll
n ext
ĊĠĠĠĠ ĊĠĠĠ
b ar
P l
Ġin ter
or ch
Com ponent
fer ence
H e
Ġc ode
Ġ ag
ĠC om
com p
Ġval id
un it
an k
L o
lic ense
Ġand roid
Ġp y
id get
h as
n ect
> >
ĠS t
m ain
Ġb ase
v ider
com mon
erm ission
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ifi ed
Util s
To ken
Ġm in
ot e
Ġcon sole
d a
Ġdistrib uted
ser ver
ult i
tot ype
col or
ain s
b ody
t ected
In ter
Ġ( '
fo re
res sion
ifi er
Ġrequire d
Ġn e
A l
Lay out
w idth
all y
res h
ic al
u age
T ypes
ww w
Ar g
O D
F rom
loc ation
Ġs ource
B ase
r ag
r id
Ġd at
c lose
Im age
roll er
i ent
po st
ff set
p ace
ific ation
Ġwh en
Ġ array
Ġa ction
s up
č ĊĠĠĠĠ
Ġ query
ail s
Ġob j
a de
ab ase
" .
ilen ame
e lement
a ir
Ġval ues
C T
P O
B lock
c le
Ġ row
Ġim age
' ))
ad ers
b lock
w h
n ing
c all
b l
Ġs ize
s ing
pr ing
E m
Ġc lient
av ax
export s
U S
N umber
Ġ up
U N
M ethod
P E
Ġ ],
b uild
U rl
in es
Ġ X
n g
ct x
id d
//// ////
F I
o v
å ı
or age
M P
eat ure
ens or
ex p
st ant
se arch
ĠO F
g ing
cl ude
im g
Ġ Ð
ĠAr ray
m y
AM E
v is
u id
def ined
H E
ro p
Ġj son
ri x
ĠD e
Ġo ther
tr act
E d
op en
' s
P age
f inal
Ġ load
re quire
Ġst yle
com ponent
L abel
l p
sh ow
T Y
ic on
M L
pro ps
ĊĠĠĠĠ ĠĠ
s ource
Ġparam s
ĠI f
P oint
p arent
per ation
Ġ Exception
s rc
val ues
n umber
at er
H O
Ġ Ex
o ve
Ġn et
Ġ ad
tt p
D is
d oc
frame work
Def ault
equal s
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġg ener
Ġa x
Ġcont ent
d own
ç ļ
Ġ http
çļ Ħ
H T
g ener
Ġ/ >
pos it
d d
n der
to String
r a
se nd
n s
ĠR eturn
o ot
p ush
orm al
f alse
Ġc all
čĊ čĊĠĠĠ
ĠI N
pro totype
Ġc o
", "
f loat
re en
Ġo pen
w e
ateg ory
im ple
ent ity
al c
ol ic
ang o
model s
d o
Ġl ong
C ase
p age
Ġre ad
auth or
c od
ĠR es
ĠS et
v ide
Ġuse d
ust er
Ġf loat
Ġm ap
il ity
m ark
Ġ one
Ġj avax
iz ed
R AN
f low
AT E
Col umn
A uth
Ð ¾
V ar
å Ī
Ġcol or
y mb
ex ample
Ġt itle
\ "
R I
Ġv ersion
j ango
re q
ial og
č Ċĉĉĉ
Ġto ken
p atch
k wargs
Ġ ed
ot al
e ar
' .
ect or
th on
p x
ex ec
[ :
b in
st ore
Ġm odule
ed ia
ang uage
ial ize
++ )
h ost
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
le g
Ġn ext
S tr
it ies
iz ation
m od
p art
Ð µ
Ġ{ '
L ine
Ġf l
ĠĠĠĠĠĠĠĠ ĠĠĠ
om ain
app ing
En d
C E
ĠC ON
F ilter
Ġh ave
S ource
G ener
ro ot
Equal s
an el
at tern
er n
pro perty
D et
it ch
unt ime
s cope
f ix
as ses
Ð °
re place
C ON
j ava
at t
g round
ser vice
c or
Ġp art
ymb ol
In teger
Ġan y
pro ject
Ġas ync
O Exception
Ġ us
ol ve
Ġt able
an y
em ber
Ġ! ==
b uf
iv en
s pring
form ation
irect ory
O ptions
Ġwh ile
Ġf irst
C reate
l ast
Ġse lect
Ġwh ich
l n
p lot
m atch
ig h
St yle
V ersion
Ġpro cess
ap h
ition s
P r
Res ource
\ \
Ġg roup
A nd
ms g
re act
( _
s ave
Ġexpect ed
F A
l t
Ġm atch
Ġv iew
ist s
t x
Ġcol umn
t d
' t
Ġl imit
p c
Ġd b
Ġ( (
UR L
ES S
p end
str act
T O
o pt
com mand
de lete
Ġw ork
Ex p
b utton
C heck
en der
n ames
ap ter
is h
le ft
L I
per ator
am b
Ġ --
ock et
Par ser
E X
Ġ ,
ild ren
C lick
posit ory
Ġt orch
ĠS ee
Ġfor mat
H el
c y
gr aph
w ard
N AME
Ġa uth
a use
col umn
At tribute
ĠS ystem
Form at
L ink
Ġ/ *
our ces
Ġstat us
d ist
] );
item s
opy right
Ġim ple
th en
s ign
li p
un k
W idth
Ġw idth
Ġp oint
By Id
t n
St art
t ask
de bug
str aint
Ġc allback
lo ud
Val id
Ġl ast
ĠF ile
P I
Ġp ass
ĠT est
Ser ver
Ġ' /
x y
ã ĥ
iz er
trib utes
Ġb ack
ĠI S
Ġp er
") );
et ch
P re
up le
C l
b ot
'] )
et ime
x ml
c at
* /
Ġ Q
O b
le m
J son
T he
olic y
Ch ange
rap per
Up date
he ight
id x
S ystem
b ind
Ġm e
i k
Ġm et
struct or
T ask
ion s
en e
T em
m t
F F
F rame
R ow
T H
Ġ argument
Ġon ly
Ġre f
ĠAN Y
sp an
Ch ar
row s
r ic
key s
N o
annot ation
B uffer
Ġpar se
Ġo pt
Ġf ind
d im
c lick
ES T
t ag
ĉĉ ĉĉ
Ġp age
Ġ> =
ses sion
re l
ith er
ex pect
if t
Ġmodel s
Ġpro tected
ĠReturn s
Ġc ount
Ġf ilter
Ġre nder
print ln
Com mand
g ress
ï¼ Į
c c
ty pes
set s
spring framework
le ss
re ct
Ġp ermission
Ġ[ "
ĠC opyright
ĠW AR
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
al led
Ġfor m
ĠG et
ul ar
L IC
Ġp arent
B ox
gr am
im est
Ġm od
lo y
ch annel
Ġof f
at ing
M et
t ing
s k
scri pt
ir on
F unction
Ġser ver
] ]
M odule
Ġ ar
de scription
pos ition
Ġcom mand
ĊĠĠĠĠĠĠĠĠ ĊĠĠĠĠĠĠĠ
ile d
Ġ q
Ġm sg
Ġ ap
Ġre g
Ġcom p
i ction
U P
bo ard
: :
le ase
ent ial
Ġc ur
M ode
Config uration
ast er
Ġcom ponent
b atch
file s
ess ion
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
r ad
or ld
ow er
qu ence
ĠL og
Ġ< =
I s
Ġassert Equals
mo ck
id s
Ġv er
pli ed
are d
Ġd ict
s ample
ĠT h
Ġd ate
Ġor der
f irst
Ċĉ Ċ
Ġg iven
Ġr ight
Ġt f
{ }
st ream
if f
s pec
Ġlog ger
t ain
Pro vider
em b
f ter
U M
S up
ay load
Ġm ust
Ġpar ser
t om
r andom
å Ĳ
Ġl ay
ĠWAR RAN
ĠC ol
r on
Ġex ec
el se
IN D
Ġfile s
C o
æ ľ
" ],
tern al
ĠI m
ith ub
En try
ĠY ou
ess ages
Ġde scription
M A
Re f
c ase
um e
Out put
> <
Ð ¸
ĠU ser
tr a
> </
OR T
Ġhe ight
eat ures
o le
Com p
Ġc or
d u
> ();
Ġtr ain
ab s
st ri
ic le
čĊ čĊ
s v
M od
Ġso ftware
Ġspec ific
H ash
TION S
ail able
ang ed
K E
add ress
] :
Ñ Ĥ
ch ar
UL T
Cont ainer
: "
v o
ay s
ut or
u ch
St ack
Ġw indow
Ġm ock
M E
Ġ ...
W indow
', '
ĠA n
Ġo ver
æ ķ
Ġb lock
T ag
Ġ ),
u x
proto buf
ĠC h
Ġe ither
co py
Ap i
act ive
Ġi o
s l
S to
Ġm ain
Ġw rit
Ġ local
Ġt ask
ä »
Ġres ource
H eight
Ġs p
Act ivity
Add ress
. """
i an
ol low
c ache
ch ange
n ow
è ¯
Ac cess
ac es
Ġhe lp
Ġch ar
Em pty
amb da
ĠD ata
license s
Ġ Ċ
j unit
v ed
ren der
TI ES
ĠW IT
E L
Ġro ot
Q L
w eight
ot her
= [
Or der
../ ../
Ġ" \
le vel
imest amp
Ġm ake
Ġl anguage
ref er
Ġf ound
(' .
stat ic
Ġh andle
() ).
M enu
P art
t ed
de t
)) ,
ializ er
to ol
Ġs ys
)) )
P er
m ode
` ,
que ue
Ġin st
V ER
un ter
R eturn
an e
set tings
er o
Ġ ass
)) .
ĠD ate
R un
ĠAp ache
ĠM ap
im al
EN SE
sh ould
Ġe ach
a iled
gist ry
at rix
(' #
act or
Ġa v
Con nection
Ġ" /
ĠS er
ri ver
Ġ{ "
} >
() {
Ġis instance
t s
Ġs w
V is
Param s
Ġse s
d ocument
Ġ( "
w indow
h andle
Ġ arg
O L
c ss
H ttp
Con stant
d s
m er
N ames
w o
Ġ' ./
(' /
arn ing
g ithub
s or
h ash
Ġ' ''
Ġsh ow
T R
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Pro cess
par ser
rom ise
ack age
ĠJ SON
ĠO ptional
Ġun defined
add ing
um er
C ache
Ġdo uble
pre sent
Ġses sion
ist ory
em ail
o use
Ġpro ject
ĠM ath
i que
ent ic
Ġto p
in ue
J SON
å ħ
ang le
Ġw as
sp ace
Ġpos ition
**************** ****************
ĠWARRAN TIES
tem plate
em ent
Ġb uild
Ġser vice
Ġpro perty
Arg ument
ĠV ersion
de vice
He ader
Ċ ĊĊĠĠĠ
in ition
C L
Ċ Ċĉĉ
per s
Ch ild
ap t
Ġl ength
S ession
Pos ition
port ed
in s
p assword
Ġ" ,
port s
L icense
Ex ec
Ġresult s
Ġ$ {
Ġexp ress
alc ul
O P
Ġob tain
Ġd f
Cont roller
re gister
Log ger
m ask
Param eter
ig inal
r ange
ent er
a a
cur ity
p loy
Ġ qu
Ġm y
ont h
ĠA s
E ach
rag ment
D B
Ð ½
HO UT
Col lection
ĠArray List
Ġag re
Ġn ames
ĠC reate
Ġt otal
dis play
################ ################
Re cord
n own
Le vel
tot al
b ook
u ck
ç Ķ
T arget
Pro perties
f unc
ĠS e
Ġb ody
idd en
Ġre l
i as
c p
he ader
st ack
A b
co ver
enc y
Ġb atch
ire ction
ĠIn teger
at ure
ig r
g in
po p
V AL
con nect
Q U
I con
F l
P RO
Re g
Ġr andom
ĠWIT HOUT
B ack
. *
Ġin d
component s
f ilename
pro p
ol ution
æķ °
Ġre q
le x
Ġp ost
T itle
a o
gr id
ref ix
T op
ff ect
æ ĸ
Pro to
Ġpermission s
o ffset
c f
R ule
L ength
lo ss
č ĊĠĠĠĠĠ
s ort
r ics
Ġby te
res ource
= (
B ody
l ong
g en
Ġde lete
g n
T ER
ut f
č ĊĠ
f r
Sto re
ĊĠĠĠĠĠĠĠĠ ĠĠ
` `
in ner
con f
ĠT HE
X X
I M
Ġ å
Ġen v
Ġg lobal
Ġ ctx
P anel
Ġs rc
n n
Ġp ort
A TION
f ull
In it
scri be
S pec
pl ugin
ã Ģ
an ch
ph a
As sert
p i
C all
Ġus ing
p ing
ĠC ont
read y
B ar
ad min
at form
g o
sc ale
he l
================ ================
C allback
Ġdo es
Ġb ut
en ces
ĠK IND
ers on
Lo ad
M atch
lic e
KE Y
Ñ Ģ
ign ore
Ġm ore
im es
pt h
v as
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
D o
FA ULT
Ġse arch
Ġdis play
d raw
TY PE
tx t
M ax
D ir
log ger
Ġ[ ],
Ġinstance of
Hel per
s m
Ġlog ging
ig ger
Ġh ash
und le
Ġm ode
ent ifier
e ed
ry pt
point s
T P
M ock
pli ance
Ġtem p
O M
g s
Ġapp lic
p ed
ing le
Ġb ot
io us
ub l
Ġre t
Ġin fo
ĠRe act
put e
Ġ En
f n
Ġs k
b it
ut ure
Ġim plied
": "
R out
g ame
A g
st ep
em ory
L ong
el ine
Ġre move
Desc ri
Q ue
po ch
Ġ Value
im um
data set
Se arch
ple te
} /
act er
N ew
T E
, "
Re ader
Ġg over
Ġs ort
Ġpl t
p ng
Ġex ception
AG E
W eb
LIC ENSE
arg in
Ġc ache
Ġent ry
p ol
A Y
Ð¾ Ð
Loc ation
po se
Ġpro vide
Ġal low
ra ft
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
e ps
row ser
Th at
l ate
ĠLicense d
ant s
Ġoff set
Ġin to
Ġne ed
Ġt ag
Ġwrit ing
å ®
Ġp red
Ġit er
Un it
c an
im er
) ]
de v
ĠDe f
g l
Ġparam eters
Ġs ign
Ġl ink
hed ule
è ¿
Desc ript
Re ad
S ER
(" #
f s
c i
im ary
N et
T ree
Ġst ore
Ex t
Ġle ft
R em
. $
Ġf ont
ver se
Ġ api
~ ~
Ġim g
Ġ https
OD O
red ential
S p
ĠI D
n ap
App lication
Tem plate
c loud
Ñ ģ
M in
ĠT ype
w n
ĠG ener
o ftware
čĊ čĊĠĠĠĠĠĠĠ
in ce
result s
D ocument
ĠĠĠĠĠĠĠĠ Ġ
sh ot
cont ains
Ġcont inue
D ialog
Ġ æ
Ġapplic able
trans form
Ġcom pliance
AC K
Ġre cord
AP I
Be an
iron ment
Ġhe ader
Ġo p
Ġargument s
ul um
Ġvar iable
val u
C ard
in sert
N um
Sc hema
o ption
ĠB AS
Ġv is
m ary
ä º
(" /
get Name
ex ception
Ad apter
cont ainer
Ġ Error
c ard
Ġde t
Im pl
AB LE
O ffset
Ġl aw
Ġs ave
M O
IT Y
ol ume
ĠCON DI
field s
Ġfield s
To ol
ĠA dd
low er
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġgover ning
ĠBAS IS
g ment
S S
as ic
l ight
ĠCONDI TIONS
W riter
N on
Ġse cond
ud io
Ġw rite
Ġnum py
s ql
Ġp assword
Ġbe fore
ur i
Val ues
Ġin formation
Ġex ist
se cond
M apping
Ġlimit ations
m ed
cent er
t f
( $
by te
F T
tem p
Ġf ollow
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
pro duct
ire d
al le
he ad
[: ,
expect ed
å Ĭ
( `
a ded
Ġtem plate
in ation
ition al
is ion
ulum i
W idget
Ġcon nection
Ġparam eter
Ġagre ed
ac count
user name
a uto
object s
action s
j ob
s ide
Re pository
f oo
Ġs um
in ary
exec ute
U E
o perator
Ġp h
E C
Ġimple ments
s uccess
ĠS h
pre d
G ET
ĠT o
ance l
} .
Ġs ample
ri ct
Time out
al s
Ġspec ified
re cord
'] .
C ell
Select or
ent ry
Cont rol
w idget
( -
cs v
Ob j
Ġ[ ];
Ac count
č Ċĉĉĉĉ
Ġde st
r t
ĠUn less
as ync
Ġh ost
ib r
i ver
( __
ent s
Ġset tings
Ġse nd
get Element
Ċĉĉ Ċĉ
Ġs uccess
c allback
i od
Ser v
Set tings
Ġy our
e ch
eng ine
c ast
am er
Ġde vice
U ID
ĠA PI
Ġf in
St orage
D own
cod er
am ount
play er
load er
ord s
Ġ err
å ¤
//////// ////////
net work
ĠI OException
Ġa fter
g b
D at
assertEqual s
ut able
Ġwh ere
ord in
ut er
b oolean
Re ference
app lication
Ġat tribute
M M
i us
Ġpre v
EN D
ĠC lass
N O
[ -
By te
ch ild
st op
è ®
Re quire
ma ke
B oolean
Ġ' .
æ Ī
as on
c ustom
we en
o om
ĠS c
an ces
a i
se e
he et
R ange
d k
ç »
ix el
im ation
s ol
lay out
Ġc ustom
th rows
Ġch ange
me an
y m
I G
Ed it
ĠD E
Ċĉ ĠĠĠ
} `
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
f ont
Ġth en
ax is
P layer
M sg
V E
Ġ{ };
in st
Ġb uilder
W ork
s core
Ġch annel
Descri ption
Ġ$ (
pe ed
con sole
r ule
cle ar
assert True
c r
< ?
d jango
lt a
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
label s
d omain
() ))
Ġd im
' ):
Pro ps
ide o
Ġ> >>
pre fix
per ations
le ar
uck et
e g
Ġcont ain
l imit
ang es
Ġj ob
sc hema
ĠL O
ializ ed
ER R
z er
o ff
ce ll
cl asses
ug h
ern el
O peration
Ġg raph
å Ń
s ystem
Ġo ld
P h
Item s
P ost
x f
I ter
param eters
Lo ader
r am
Ġ Z
is sing
ed it
log in
Ġcon d
leg al
st d
Ġs ame
ar r
Ġd one
AT A
m an
Ġat tr
de st
Ġcreate d
met adata
im ages
ä ½
cre t
a j
et ry
ĠW h
Not Null
ĠT ODO
C urrent
Ġ` `
Ġinter face
iv ed
Z E
Ġem ail
R ender
ator s
P L
m enu
Ġf rame
Ġm ulti
Ġd oc
Ġitem s
ap ply
z e
Ġ" .
sw ing
Pro ject
' }
Descript or
J ob
O pen
g lobal
is hed
w ay
and ard
i ke
R L
I OException
bo se
_ .
m ine
r u
P arent
i er
Ġpro duct
Var iable
for Each
res olve
Ġent ity
Ġw eb
By tes
Le ft
l ing
ĠS oftware
Loc al
Ġ" "
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
R ES
Ġac count
Ġ location
O ption
m eta
ir t
g gle
oc us
Ġst ream
Ġb l
Ġm ark
ab ility
Ġle vel
' },
i res
En abled
W AR
( ()
G raph
Ġch ild
idd le
Ġ ĊĠĠĠĠĠĠĠ
'] ['
S ign
et ween
ex ists
O ne
Ċĉĉĉĉĉĉ ĉ
ip eline
Ġb utton
module s
Ġb ool
node s
inter n
se n
ĠN ot
In valid
è ¡
Ch annel
ension s
select ed
(" \
um p
Ġf ilename
Ġdata set
Exp ression
F ound
Th read
Field s
v m
li de
Ġhe aders
G rid
Ġwith out
< >();
Ġh ref
im pl
x b
oc i
b s
o od
con v
P ort
amer a
al end
ign ment
bo und
Ġdat etime
c imal
av ig
Ġdat abase
n ormal
Ġem pty
Ġax is
Ġadd ress
Ġr ule
i um
Ġac cess
ĠDef ault
] ))
Ġp d
) }
g t
Ġun it
em pty
Ġtrans form
Ġ' <
yn am
N ext
M eta
Re gistry
cl s
m ission
Met adata
F OR
g ed
+ "
Pro duct
ex pr
al y
Ġp layer
çĶ ¨
Ġn on
l at
type of
web pack
ro le
Ġn n
se ction
nap shot
ĠC heck
æ Ĺ
Constant s
SI ON
Pl ugin
sup er
e v
r ate
c md
con nection
ST R
ri or
s ys
Ġ' #
Ġ Key
ĠH ash
or ies
t ree
ac ity
C C
resh old
d ay
l ines
ĠAp p
oo p
b uffer
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ack et
ĠAs sert
* -
Ġassert That
ig in
Ġst ep
ĠĠĠĠĠĠĠĠ ĠĠ
t mp
i os
r s
f in
ĠF or
P ool
Ġth read
p k
Ġth ere
c d
Ġd jango
ac cess
Ġcon vert
(' ./
P AT
g es
Ġpro perties
d om
p g
av ed
M S
Ġpro ps
Ġcol lection
ib ility
lay ers
Det ails
ĠB ase
e am
cod ing
iction ary
Ġcont ainer
b ed
Ġit s
Ġ" <
l legal
Ġsh ape
is s
en code
urre n
re t
R ole
Ġ loc
() ));
C ustom
-- -
Ġd own
P ER
P olicy
ch ildren
time out
Ġreturn s
alend ar
Ġst rict
u ction
Ġ' \
P assword
f eatures
Map per
Ġw eight
æ ĺ
h older
ĠT ext
Ġsw itch
Select ed
ERR OR
od ing
__ __
Ġcon f
Ġd type
Ġf ull
R ed
eth er
f it
b uilder
Ġg r
return s
pro file
pre v
as ure
redential s
Ġ- *-
R el
: `
intern al
p Types
T his
ĠH ttp
c raft
Ġm er
gr ad
arg e
En um
W rapper
D O
f ill
Ġselect ed
ar m
AL L
is Empty
Ch anged
Ġ ĊĠĠĠĠ
Ġ license
ateg y
Ġ' '
â Ķ
af e
ve lo
cont rol
le ep
Trans action
pro perties
Ġd irectory
Ġb r
Ġfollow ing
] ),
W h
I P
require d
Ġf ail
ĠN OT
U B
Ġb uffer
ri es
he aders
ir m
Ġh ere
Ġc lose
ĠA ll
A SE
D S
entic ation
f eature
c ip
Ġinit ial
b reak
c ategory
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
PO ST
set Text
re m
.* ;
Ġ ;
w s
vis ion
am ed
Def inition
ĠValue Error
Ġre ference
stri p
h andler
x c
Ġsc ale
m ar
o ice
f older
w ise
not ation
Ġex ample
Param eters
O S
b tn
" +
k nown
B U
I f
SI ZE
do uble
Ġprovide d
Ġe v
â Ģ
å Ľ
l s
Ġ View
it ude
P AR
M ENT
S w
Ġ ì
R oot
(" .
t ab
Ġin clude
var iable
) ):
mat rix
l in
ĊĊ Ċ
es h
Tr ace
ol ver
ĠS ub
ot o
Ġcl s
valid ate
Ġbe en
Ġo ption
ac y
get Id
ver y
Ġp lot
L ast
f ul
Ġ" '
Ġk wargs
ĉĉ ĉ
am il
o us
Ġth an
ĠP aram
p ress
est ed
Ġkey s
on ly
ĠCon fig
r untime
De lete
ce d
Ġ ignore
d rop
un try
ĠH T
g reg
riter ia
Inter face
Ġm at
m ember
Input Stream
Ġre ce
g or
Ġimple ment
F ragment
Ġby tes
. ,
Ġ ĊĠĠĠ
getElement ById
ĠP y
use d
" ])
l ambda
j e
Ġp adding
M ark
get String
col lection
Ġ$ ('#
Ġ html
Ġgener ate
Ġav ailable
ĠN O
S C
re qu
HT ML
in clude
Que ue
Ġre present
t en
ch ron
w d
B l
Ġm ask
EX T
Ġ" ",
aise s
ĠU RL
Array List
F loat
H ER
TI C
s ite
Ġt mp
ad o
D el
Ġs b
j o
Ġs ystem
Ġlay er
S ymbol
Ġconfig uration
d one
n one
W E
x d
re st
get Value
al ys
ver ter
ix ed
c rypt
R ight
: '
po ol
and roid
+ '
, '
Ġe qual
Ġro le
Ġ icon
Ġc ell
Ġh andler
] ['
m anager
Ġen umer
al og
Ġ' ',
irt ual
f ail
ĠIm age
D ER
alys is
( @
Ð »
E l
r and
U RE
user s
++ ;
Ġt y
re set
T ab
Ġt ree
Ġf eature
D oc
Ġmet adata
Ġnet work
Ġauth or
om etry
M ath
if fer
{ '
ee k
x e
dat etime
LO G
.. ..
Ġst op
Ġn ormal
par ator
Ġlo ss
gor ith
by tes
{ "
t ensor
w ner
se q
A ss
De vice
Ġc v
â ĸ
D ict
row able
Con straint
ON E
(' \
ro ute
Arg s
Ġal ready
im ul
arn ings
ãĢ Ĥ
R est
at io
c b
yn chron
ynam ic
vo ke
Ġn ow
Ġj ust
ann er
ater ial
ĠLO G
tr ack
con n
Ġor iginal
DE FAULT
cl uster
C lose
Id s
ĠO r
B ound
Auth or
mo unt
c atch
ĠN ode
y ear
emb ed
pre c
Key s
A A
Serv let
å º
ex it
bo ol
ar io
-------------------------------- --------------------------------
) [
> (
ro ss
ĠB uilder
Re port
Pro file
Ġo ptional
D raw
def ine
ans w
ick er
SE T
x a
d ing
IN T
ĠD o
Ġre gister
ĠA b
d irect
Ġ{ },
Ġ' ../
Ġg ame
Ġpl ace
Ġcon structor
AS S
m ulti
O p
S uccess
CO L
c id
C K
Ġp ayload
Ġuser name
Do uble
ath er
p ass
En v
D ist
DI R
h idden
H ost
Ġact ual
Ġd raw
im ent
Ġsc hema
index Of
Dis play
æ ł
it o
to Be
RO M
( !
Ġo peration
at s
S ync
. ",
ay ment
Ġf r
Ġse e
a ff
de sc
n on
Ġat t
pro b
em o
al k
Ġ( {
ĠIn t
word s
Ġpl ugin
} </
l ap
A re
ĠL ong
Ġb ox
c hed
Sc ript
um b
ĠP ath
refer ence
th row
ĠU p
Ġb ound
sum er
oo se
é Ģ
os s
Ġact ive
alcul ate
emb ers
al ance
Ġt ypes
event s
al t
Ġobject s
Lay er
ĠAN D
il er
PAT H
U I
X ml
end ing
B ind
e le
Ġlabel s
File s
Ġp refix
Ġd ir
State ment
Ġpro b
IL ITY
Ġc alled
m ath
tool s
Ġs ome
column s
w orld
Ġg rid
ĠRes ponse
p are
/ >
O K
æ į
are a
a h
ic ro
u uid
ic ate
Ġc re
: ]
Ġnode s
Ġid x
F O
S H
å ¼
F irst
ĠPro pTypes
bo ot
error s
p u
Ġm argin
if act
dir name
Ġst ack
t ags
i ant
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
app ed
P RE
ĠS O
Act ive
q a
x x
Ġpy thon
n ess
Ġs ql
M e
ĠW e
Ġc md
sup port
\ /
py thon
ke ep
U D
style s
str uction
. ")
ä ¿
Ġs ingle
de code
am l
Ġw ord
urren cy
Ġ: :
Ġreturn ed
ro y
Ġa uto
doc s
ĠL oc
( *
Ġset up
enc ies
Ġ' @
Ġg o
stat s
re port
F ont
P ackage
' +
sh ort
. "
C re
Ġsc ript
Ġrequest s
t orch
Ġcor rect
Ġpro to
Ġ' -
Ġ" ";
Em ail
Ġver ify
c ar
zer os
co res
C ategory
Ġt uple
Ġtime out
Ġr aw
ro uter
å į
Ġc lear
Ġelement s
sc reen
k it
Ġ' ,
Ġcon n
AN T
ĠI llegal
Ġm atrix
G ame
O UT
Con d
create Element
Date Time
it es
i ag
iter al
G ER
p a
R ect
ro ugh
n orm
se curity
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
serv ices
Ġmethod s
I O
P ORT
Ġt wo
ĠTr ans
hed ul
ext end
com ment
f actory
con cat
iv es
D ATA
UR I
ĠF OR
ple ment
m edia
LE CT
On ly
t a
S QL
Tr ack
ce l
com m
A v
Proto col
p attern
o ad
US ER
f etch
Ġerror s
St ep
ent ion
Ġvalid ate
l int
pr ice
e val
e poch
dat abase
start s
In d
e f
y y
st orage
h ide
Ġm eta
s ocket
Ġres olve
" }
d ot
ĠB y
'' '
act iv
Ġb etween
F eature
Ġcon nect
'] [
input s
v oc
Ġback ground
IN E
s lice
H older
M ain
Sc roll
Ġpoint s
gorith m
Ġ es
serv ed
as sed
Ġs plit
Ġar r
={ {
view s
Net work
so ft
> {
get S
b ers
ub e
Ġf unc
" ):
Ġy ield
Ġstr uct
al low
v ue
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
ĠA uth
Trans form
c a
c v
and id
Sh ow
ĠA t
im izer
Ġ Ċĉ
mine craft
` .
Ġf etch
en ded
log ging
Test Case
or iz
) (
ĠA l
Ġtr ack
ĠE vent
ibr ary
Dat abase
> \
Ġt x
Ġin cl
ĠB lock
ol y
Ġd iv
ä¸ Ģ
)) );
channel s
m m
B ot
Ġf s
Ġcl uster
con vert
ubl ish
/ {
s u
Pro gress
i ate
at ic
ĠIn put
A uto
create d
ĠN umber
Ġ utils
Ġ ).
as c
C an
M ulti
e q
Be fore
ir cle
get Instance
e er
sc roll
ass ign
] +
Ġse nt
Ċ Ċĉĉĉ
WAR E
Ġp erson
åı ĸ
Gener ator
AN D
P ermission
b eta
ĠM odel
Par se
l a
ĠP RO
con trib
c ap
t ip
Ġp op
ser ialize
å ľ
ro t
## #
Result s
get Message
h ome
log y
T otal
( /
ist ence
Event Listener
R ad
. ");
lip se
Ġ queue
f c
Ġ" #
Ġp attern
ĠE X
k a
Ġb order
Ġw ait
ĠB oolean
Se lection
M edia
i or
Ġ Request
mat er
Ġp ackage
Con f
Ġapp lication
un defined
A ut
d iff
ple x
igr ations
Ġ} ),
ĠR E
o se
Ġl ines
let ed
V ert
j ust
f g
A X
As ync
ac c
Ġevent s
vide o
Ġp ulumi
M atrix
Cl uster
gener ated
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
P R
Hash Map
TI ME
Ġ$ ("#
Ġ --------
H andle
G r
p m
e ach
param eter
C RE
Ġ_ .
gener ate
res pon
s ure
al let
æ ī
FI LE
ĠP ar
s ible
Pr ice
o ard
V ector
anag ement
ĠT ime
ĠP AR
iffer ent
C ur
ĠCol lection
com mit
D ATE
ĠAr gs
et s
Ġde bug
un ch
AB ILITY
it ive
a ut
g y
Ġver bose
at tribute
uc er
(' --
ver age
C ore
k er
reg ion
Ġb it
set up
i i
Ġ' "
pro tected
op s
Ġch ildren
Ġcopy right
; </
test s
ac ing
d r
**** **
Ġs cope
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
Ġenumer ate
B uild
cf g
Ad min
Require d
Iter ator
MA X
à ¤
ï¼ ļ
aw s
S D
ploy ment
VAL UE
Ġcont ains
Ã ©
Ġde pend
co unter
P attern
z ip
Ġ" ./
group s
S um
Ġ" -
b a
= \"
cont roller
p ag
Se quence
mo v
Mod al
Ġext ension
Ġed it
X ML
ud ent
z z
ç ½
AC T
": [
iddle ware
ĠA c
Null able
Ġ$ .
Ġl ambda
de lta
In ternal
å ¯
ĠI tem
CON T
Ġpro gram
Ġmer ge
th read
Ñ ĥ
s q
t ick
ag ent
amil y
Ġl ike
annot ations
å ĩ
Ġun ique
Ġat tributes
te am
é ĩ
ach ine
æĺ ¯
e ad
ind ices
D F
Ġupdate d
å Į
Ġcolumn s
mater ial
Ġf ill
Ġto ol
B undle
G L
h av
S ocket
n a
Ġ art
ĠHash Map
Id entifier
ro ke
IT E
w ays
ist ic
Ġv ert
Ġon Click
Ġre place
č ĊĠĠĠĠĠĠĠĠĠ
p ayload
f a
d river
al pha
Ed itor
pl atform
p ad
Ġ' _
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Not Found
j sp
Are a
F ore
Ġc lick
At tributes
âĶ Ģ
i po
ĠLog ger
our s
" ].
m essages
ä¸ ª
F ull
Ġde l
per iment
d type
Log in
gn ore
ĠL I
Ð º
b b
pli er
| .
Ġprev ious
sk ip
Re ce
B O
ure d
W OR
d t
am pl
z one
FT WARE
re al
ĠI t
) /
pro t
! !
res ources
sv g
S k
G HT
() ),
Ġsh ort
answ er
Ġal so
Ġ è
Ġcont rol
ir d
Ġf ailed
D irectory
c ause
back ground
W S
on es
m utable
lo or
Reg ion
= -
z h
Ġt ags
g a
') );
quest ion
ad ow
col lect
W N
Ġs m
Ab stract
Ġ' %
Ġopt s
rib ution
Ġre port
ĠW eb
proto col
Ġin sert
tr ace
im ate
Argument Exception
Ġt ensor
à ¸
Ġ" +
Node s
d ates
Ġass oci
G e
Ġres p
g ine
U LE
Ġtype of
s leep
argument s
čĊ čĊĉ
ializ ation
ĠF ROM
Ġfin ally
Ġt er
Rout e
in ess
h igh
Ġm enu
Ġr ad
E CT
( ['
B atch
" },
Ġ( _
M IN
AN CE
P ane
Ġab stract
M OD
m ail
se ed
Event s
' \
ĠN ame
ordin ates
cl ar
om ent
Ġz ip
Ġ\ "
value Of
B P
s ymbol
æĹ ¶
Ġf ig
Ġd on
ert ific
aw t
Ar t
Ġm an
ĠJ son
Ġdet ails
Ġde sc
ch ain
æį ®
cl are
Ġd irect
UT H
ache d
ä¸ º
ed ge
Ġ} ).
Ġg e
valid ation
Ġc ategory
Ġgener ated
Ġc enter
AR T
ĠSO FTWARE
ĠR untime
L ock
Stack Trace
Ġadd itional
S P
ĠAb stract
tr ie
Det ail
t imestamp
ĠP romise
tr im
d um
Ġde v
> ,
w t
sh ip
s i
G E
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
he ll
P UT
gist r
pl ates
Ġe lem
ĠO n
() [
p air
s ig
Ġa ut
Ġx ml
ĠCom ponent
Ġinput s
us r
qu are
at tributes
L A
Vis ible
script or
ate way
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
sample s
Non Null
Ġ amount
} }
Ġb uf
Ġright s
py test
Ext ension
Ġno qa
De cimal
j pg
f ire
Ġw ant
f aces
) ",
arg v
č ĊĠĠĠĠĠĠĠĠ
Ġs core
P refix
Ġreg ion
je ction
Inter val
A x
ç Ľ
ple t
Ġg en
__ ,
Sc ale
ĠD is
pl an
ist ics
o ptional
an c
Ġcl asses
h r
Ġsup port
Exec ution
Ex pect
uff ix
Ġ' __
S cope
Ġc oding
Ġex ists
ter m
Ġlo ok
ver s
ĠS QL
check ed
In st
oriz ont
> .
hedul er
/ ',
set State
ar i
u ce
ĠM essage
Ġthe m
Ġ' --
ä» ¶
AP P
com pute
al th
g re
Ġrow s
avig ation
string ify
Ġad ded
Sc reen
P air
N OT
od o
ro s
Ġs l
C I
Ġab ove
é Ĺ
w rap
~~ ~~
} ")
B r
se c
Ġap ply
u ded
ĠA d
'] :
E ffect
bot tom
Ġuser s
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠ
F ail
ä¸ į
T ensor
Ġo wn
UL L
å ½
Ġf n
Ġc y
ĠN o
Ġexec ute
V ENT
int e
e ff
Ġcom mon
i ps
d ash
n av
str ap
Ġ" __
S imple
ĊĊ ĠĠ
U ri
h istory
ĠTh rowable
he me
if est
ir c
Ċ ĊĠĠĠĠĠĠĠĠĠ
C P
Ġ" _
Ġl a
p lic
co s
Ġ ):
Ġbase d
dis able
el y
) ',
Ġre ject
V IC
Ġ et
T AG
ed itor
rior ity
vent ory
fl ag
igh b
} "
sol ute
MO DE
ic ode
ast ic
Ġhe l
View ById
res sed
> '
C S
weight s
čĊ ĠĠ
Ġdis patch
L ower
get Class
= ['
Ġhe ad
Ġ ..
A fter
R ate
F older
Ġst d
c lean
ern al
Ġtest s
å °
orizont al
opt s
h and
Ser ializer
Gener ated
Ġb ind
d c
m aster
M ember
d irectory
Ġsort ed
Ġf older
p olicy
I gnore
in f
up lic
t ure
ĠP l
> "
F ailed
Ġ[ {
G R
č Ċĉĉĉĉĉ
L imit
O wn
it ter
Pro xy
C A
ĠR ed
up load
Ġfl ag
comp ile
get Logger
Output Stream
l ab
Point er
Ġm essages
alle l
Ġf eatures
d m
l ers
C TION
æ Ŀ
Not ification
ĠF orm
æ ŀ
Ġs ocket
Con nect
ĠL ink
Ġtrain ing
Ġlay out
num py
B it
ĠIn ter
At tr
pt s
Ġem bed
ro om
path s
Ġassert True
var s
OR S
Ġbe cause
Ġre set
v id
lo op
us iness
G lobal
Ġwh ether
ĠR em
Ġt ab
ot ion
r gb
F low
T EST
Ċĉ Ġ
] ],
Ġre ader
AC E
Str uct
Ġi p
sub string
af ter
stat es
sup ported
Ġd omain
Ċĉĉĉĉĉĉ ĉĉ
Ġ} }
SE LECT
Ġs ymbol
M y
s n
w in
ĠV al
Ġk ernel
cur s
R andom
Ġ est
Ġpy test
Ġin ternal
C ap
ant ity
Ġper form
ĠP r
mo use
init ial
_ (
h ip
ĠM ock
Ġp assed
Ġd ifferent
Ġ utf
sh ift
Ġim ages
h y
Ġin valid
ĠParam eters
i ation
__ )
Ġin v
u k
Ġ util
Ġcontain ing
met rics
Ġsk ip
Ġsub ject
ĠF unction
F in
F L
ro ad
ĠT H
r ift
âĶĢ âĶĢ
G EN
Ġvariable s
V er
s im
mer ge
D ay
Ġal ign
Se cond
æľ ī
Ġb ar
I R
LE D
ĠA S
print StackTrace
. ')
Ġm ath
ĠV ar
Ġpro p
Ġlist ener
ook s
TH ER
m onth
be gin
on s
Ġc lean
sum mary
query Selector
com plete
Ġdef ined
Ġc ard
D D
Object s
è¡ ¨
ĠC lient
ud a
Ġw riter
cre ment
w arn
Ġ' ../../
At t
Back ground
gener ator
W rite
mod al
Ġexist ing
ateg ories
Ġlog in
u y
Ġex ports
ak es
Comp at
p b
config uration
ple ted
Ġ" )
"] ["
D ao
Ġst orage
Ġpro file
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
Ġbe gin
add r
Ġd ictionary
S ort
he m
ĠHT TP
Ġm ove
own er
Ð ²
n b
Sup port
Ġp ut
Ġcond itions
Char Field
ĠAn y
G B
I MP
ces sed
al ar
': '
second s
Ñ ı
tr igger
S O
Ġlo op
Ġme an
H istory
com e
sub mit
N UM
de pend
Ð ¼
Ġcom ment
Ġed ge
E W
ĠDE FAULT
D es
Ġch unk
â ķ
g est
en able
ertific ate
d x
igr ation
__ _
et ri
ec lipse
t w
al ert
det ails
ĠO THER
---- ---
de pth
Ġnot ice
ur ing
Im plement
ç½ ®
Int ent
names pace
ool s
Ġexp ression
ase s
b order
y nt
æ Ķ
Ġex tract
tr ies
pro vider
p ulumi
du ction
). __
in v
æĸ ĩ
met ric
de c
F unc
Ġcur sor
ur face
P ag
Ġse quence
L S
ic ator
Stat s
Ġc annot
to ggle
Se curity
her it
w rapper
ain ing
ifi ers
i ed
æ İ
wh ere
ĠU se
HT TP
Ġre m
Ġl at
st eps
on y
O ff
S U
iter ator
Ġab out
cur sor
RE D
é Ļ
ĠF ield
ĠCon straint
Ġp air
Ġen code
ĠM y
': {'
Ġm ov
(" %
Ġro t
cover ed
<? >
ĠS T
ä¸ Ń
Ġ-- >
t uple
Test s
Ġal pha
inter val
D omain
, -
l ation
ĠS imple
e k
se ns
en ch
Ġy ear
ĠJ ava
) *
M AT
ang ular
at om
get P
Ġre al
p or
b ad
j i
dis abled
Ġpar sed
ĠRes ource
f uture
# !
ch unk
Ġb inary
get C
wh en
O ptional
Ġv ideo
Ġde scribe
Y ear
ĊĊ ĊĊ
an ization
__ .
" {
ĠQ t
ook ie
En gine
load s
Sc hedule
ific ations
g u
Se ction
be fore
to Equal
it al
Ġc b
Ġ ct
Ġs pace
d ig
M an
Ġ" %
Ġty ping
Ġse ction
l r
Ag ent
Ġd iff
ì Ŀ
ĠR un
He aders
Ġse ed
t ile
( ?
od er
pe at
RI GHT
de ep
per mission
Ġth rough
common s
å Ĩ
Ġre served
Ġc ap
ru pt
f e
Data set
Ġassoci ated
(' ../
Con structor
L L
r ank
ĠO pen
V ID
A mount
ow ired
in valid
sh all
Ġ` ${
az y
ot h
po ut
P S
Ġen coding
se quence
Element s
r al
Load ing
Ġre st
"> </
Ġo ur
inter face
Ġs ure
valu ate
Ġm ember
w arning
Ġb tn
Ġd ay
g it
uil t
Ġvalid ation
Ġac cept
å Ģ
for ce
re ce
Ġnames pace
Ċ ĊĊĠĠĠĠĠĠĠ
Aut owired
Click Listener
Valid ator
Ġthe y
R untime
d ialog
é ¡
ĠF ound
pl t
Ġ" --
ç §
ic ip
Ġp lay
pr imary
Ġ keep
Ġ- =
ĠSer vice
æ ³
add Class
$ (
ix in
ĠE d
P C
bl ue
te ction
P y
Ġmulti ple
b g
Ġh igh
Ġfunction s
u ally
ens ity
æķ° æį®
d uration
Ġm igrations
Ċĉĉĉĉĉĉ ĉĉĉĉ
D A
čĊĉ čĊ
_ ,
Ġsup ported
serv let
Ġact iv
ĠString Builder
Ġex tra
id ual
ynt ax
Ġv m
iz es
Ġass ign
act ivity
if orm
Ġs aved
ac cept
Ġpro gress
ad s
Ġt ri
en abled
Ġdist ance
Com ment
ak er
: \
cor rect
ĠPy thon
An notation
ĠT O
mo ved
f x
u it
Ġcon v
FI G
ĊĠĠ ĊĠ
ĠUp date
V ideo
åŃ Ĺ
D R
h s
the me
Ġb est
ĠA ct
te gr
gr ade
J ava
en ers
: %
p anel
li ke
Ġf ree
D TO
N S
can vas
av ailable
Ġs imple
f actor
U s
az z
M ove
or iginal
v ector
ch at
Ġtrans action
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
con current
Q t
ex ist
pr ite
Cond ition
element s
er ies
pers istence
Ġw rapper
refer ences
o ices
ĠIn c
Exec utor
trans late
at ar
ĠIn it
r f
resh ape
sw itch
h ref
Ġallow ed
Valid ation
M onth
Com mon
he lp
un ique
ä ¼
Ġpos sible
Ċĉ ĠĠĠĠĠĠĠ
Ġrun ning
Ġw orld
lo aded
ler t
User s
il ities
c al
Ġpr imary
/ '
v olume
Ġ" );
Ġmod ify
s ync
Ġex port
ĊĠĠĠĠĠĠĠĠĠĠĠĠ ĊĠĠĠĠĠĠĠĠĠĠĠ
h a
pre dict
append Child
ur al
t ml
Ġcon trib
Ġp erm
} \
e lem
Ġad min
gistr ation
D im
ĠO ut
Ġal ert
Ñ ĭ
čĊ čĊč
P op
ç ±
D iv
M on
Col lect
ĠPro ject
End point
ĠIllegal ArgumentException
O B
T imestamp
and as
cont act
Ch ildren
Ġs im
Ġh and
ĠI ter
å® ļ
Ġp ool
ul ation
load ing
dist ance
hel per
ĠP re
sing le
h o
ch art
command s
c m
let on
ĠL e
Ġ' ';
filter s
P lay
ex tract
ĠRes ult
U UID
p df
VER SION
Ch art
Ġcom pute
S Y
D uration
U se
B ook
Ġdis able
add EventListener
XX XX
Ġsc reen
Ġp eg
Ġ ë
B inary
s imple
M essages
c ity
Ġex it
Ġt imestamp
Ġv ector
per son
Con verter
(' -
lang uage
Lower Case
v oid
F R
Or g
Ġp k
ĠC re
Ġinst ead
B ER
Ed ge
. ',
M ouse
EN TI
t imes
UN T
Ġb rowser
Un known
Ġe very
EL D
ill is
full y
be ans
W eight
rel ation
ro pout
] ).
F uture
s pect
w riter
ong o
re lease
! --
apt ure
att en
m ac
Ġh ow
bl ank
ĠM ethod
det ail
#! /
v c
Ġj oin
se cret
Ġaction s
ag ger
i pe
pro xy
Rout er
è ½
cur r
Ġthe me
Ġchar acter
Re gister
Constraint s
S pace
andid ate
Ġcor respon
s dk
Ġd irection
å ¸
ES C
ick le
z ero
Ġattr s
der r
P erson
d l
İ ·
cp u
c alled
b rowser
as sets
****** /
output s
ath s
v a
Char acter
ç± »
s ince
FI X
P red
_ ;
RE QU
b ucket
sc ene
am ma
ap er
static method
read er
at is
f d
MOD ULE
P T
ĠVal id
ĠB utton
plugin s
rom e
ĠT able
Ġ-------- --
env iron
Ġw r
Array s
ac ion
Rem ove
local host
N ormal
ĠP ublic
Ġpr ice
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
token s
lo ok
Ġe poch
ci pe
ee ded
serv able
] *
loc ity
Env ironment
cl one
Ġo wner
act ers
cond ition
s b
æ ģ
get Text
A V
c ut
J ECT
ĠTh read
trans action
' >
Ġg l
æ Ģ
BU G
at ter
m emory
åĲ į
Process or
leg ate
Ġwith in
ãģ ®
Ġde lta
S ave
dis patch
Pl ace
ixel s
el astic
ializ able
Ġen um
re pository
Render er
aw ait
Ġvis it
Ġcon s
j ack
Ġd om
am az
Ġ+ +
ol ved
E M
: {
__ ':
C or
Ġs ide
Ġt imes
D b
ex tra
co ok
n an
N av
in voke
al f
(' <
du ce
! =
ro py
CO DE
an is
={ '
Ġd uration
LI ST
Ġf ix
\ ":
pro gress
è¡ Į
Ġag ain
` ;
Res ources
ad oop
Action s
Str ategy
Ġfor ward
hav ior
ul p
F r
Ġinit ialize
} '
] ):
u int
co st
sq rt
Ex pr
B ig
ĠA R
IN ST
f loor
æĪ Ĳ
Ġ Query
Ġrem ote
Pro gram
ĠB ig
to LowerCase
è ´
$ .
Ġt erm
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
con structor
par k
ĠB uffer
le v
c li
Con tract
D est
vis ible
Ð ´
Ċĉ ĠĠĠĠ
< >(
Ġc ore
ve c
Sh ape
Y Y
Ġl ib
b re
Ġg rad
p p
requ ency
//////////////// ////////////////
******************************** ********************************
Ġs a
f ast
Sh ort
c uda
ĠCol umn
An imation
Ġcan vas
Ġthe ir
Ġs ite
amaz on
ĠType Error
D rop
wh ile
k ernel
m i
ĠN ote
cur acy
Ġm onth
fl ags
STR ING
url s
ver ify
Ġf actory
prec ated
âĸ Ī
a im
red uce
O F
rem ote
init ialize
Data Frame
rule s
Ġother wise
Ġstat s
OR Y
æģ ¯
ĠCol or
le arn
Ġ uri
VAL ID
ĠC o
W e
ot or
d irection
Ġpre sent
ĠCom mand
Ġed itor
Ax is
Ġen able
Ġs ynchron
RE AD
å ¾
ad ing
en um
Fl ag
ter s
B UT
Cont act
val s
Ġpro vider
U SE
i ence
std out
Ġc fg
Ġh idden
set Attribute
In formation
Ġ< <
comp are
V I
LE TE
down load
oo g
ient s
Ġcom mit
Ġenv ironment
ĠA ction
S l
VIC E
f eed
O perator
ar s
EN G
S top
Ġdocument ation
ĠU til
ale s
T ags
ock er
our se
Ġp ad
ĠSet s
Ġthe se
Met rics
Ex ample
uff le
Ġc op
HER E
ä ¹
[] []
r ary
se lection
riter ion
az ure
wh ite
T ick
ĠC ode
Ġp atch
top ic
T RI
m un
p et
/ "
O perations
D to
train ing
ð Ł
Ġ ----------------------------------------------------------------
Ġend point
ĠD ict
S V
Ċ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ph one
Ġn ative
Ġinst all
ol l
-------- ----
ar ies
Ġin teger
Ġro ute
ĠC ustom
m ult
col ors
rom pt
. \
- %
up per
Ġst ride
ç ī
Ġf lex
Ar r
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Sup press
ign Key
S ingle
Con v
Co unter
Ġbe ing
Ñ Į
åĽ ŀ
D irection
n ative
Ġp ack
ĠH e
p adding
re po
box es
J S
c ancel
imit ive
ĠP oint
Im port
IMP ORT
( \
Ġcont roller
ĠOr der
ref resh
S ample
b est
M ET
in c
st mt
mo b
Equal To
end point
LO W
Text Field
exp ression
le s
Ġ[ [
av or
m k
g on
exception s
Ġ' ')
A li
ĠSer ver
o res
Pl an
A IN
Y ou
å ·
čĊĉĉ čĊĉ
ĠFound ation
T erm
Ġco unter
inner HTML
un its
Ġter ms
Ġimplement ation
get Type
icro soft
T ile
M ov
he x
İ· åıĸ
Ġre trie
icon s
Que st
Ġsecond s
v ol
plet ion
ĠG roup
Own Property
Ðµ Ð½
F n
em on
AR Y
u ite
Ġdoes n
R S
ĠT em
Ġd rop
ri ve
ĠC all
B order
Bot tom
bl ack
è¯ ·
åľ ¨
Point s
ĠSt ate
M D
m bo
d ays
de l
Ġtr igger
W arnings
Ã ¡
CL UD
ĠF l
const ants
fo und
Ġ< !--
Ġs uch
ST AT
Ġ[ -
Ġag ent
clar ation
ä¿ ¡
unt il
s afe
Ġch anged
Ġm issing
Ġbot h
C ancel
Ġm on
at alog
Ġtoken s
t k
Ġ ~
åħ ¥
Ġpath s
Ġd ialog
BP ACK
a e
Ġ' {
W orld
ĠRe g
En ter
ĠGet s
th reshold
/** */
Ġ lock
em it
ud it
ĠLoc al
m apping
a udio
get Key
act ual
Ġ$ ('.
Ġid ent
Ġdef ine
å¯ ¹
Pro p
Ġse lection
d ucer
class Name
qu ires
stri ct
Ġen abled
process ing
({ '
de scribe
al ing
f ake
x s
Ġd river
Bind ing
FI ELD
ĠDo uble
c ision
ne g
pos ite
inst all
In ner
co gn
Com plete
mbo k
I Z
ul ate
S ide
th ing
P romise
ĠBy te
h i
v ices
B ASE
aj ax
G en
S core
v g
/ ******/
Ġ Qu
Ġ" {
Ġc sv
vis it
s in
E st
De bug
Ġs ig
åĪ Ĩ
æ Ń
attr s
h adoop
RE G
col s
Ġre direct
test ing
Ġoutput s
ug gest
Run ner
Ġin cid
M illis
w j
(). __
Ġset ting
pl us
hel pers
Sub mit
al ign
B tn
p ages
} ",
plot lib
Ġw idget
ter min
L INE
s peed
Ġp olicy
ĠSt at
H ome
] (
ordin ate
Ġ' )
Ġr ate
o peration
C alendar
cover y
è §
WE BPACK
Res olver
task s
Ġcom put
b asic
Set ting
y cle
a ug
serv ation
r b
Ġt ile
re c
Ġ am
Ł ¥
D river
Ġm emory
Ġto String
w ik
ĠD at
C riteria
ag ic
L anguage
ĠG rid
re ply
p ipeline
Ġch anges
class method
N ING
ĠL oad
AT ED
Ġcond ition
sh ared
æĪ ·
Ċĉ ĠĠĠĠĠ
ĠD B
Ġse gment
Ġid s
UN D
Se gment
') [
(" <
ĠN et
Ġlo mbok
CON FIG
: ',
Ġt s
f b
f ocus
ext ension
Ġsc roll
code s
CLUD ING
const ant
starts with
____ ____
ut ation
B E
Ġrel ative
d p
) \
Style s
Pr int
Ġo perator
Ġ ##
Ġm apping
Ġmax imum
F E
p ower
im ator
per iod
S ql
r aises
de lay
IN FO
() }
Ġde pth
B ag
ch or
om atic
con straint
h icle
Ġm anager
################################ ################################
IN TER
Ġdown load
T x
Ġs ince
CO MP
Auth entication
T EXT
è ¾
(" ./
Ġarg parse
jsp x
Line ar
M aterial
f p
oot er
fl ush
I ST
H tml
s lot
H as
str ument
Ser ies
Create d
__ ()
tem pt
å ±
ag ing
valu ation
')) ,
ast ype
e ffect
Ġbot tom
ĠÐ ¿
s ome
line ar
us s
ãģ Ħ
ff ff
AN G
out er
| |
CC ESS
cl us
ĠIn dex
A UTH
form ed
s cores
Ġd t
Ġent er
ĠEx ample
ab ilities
pol y
mb ed
Ġj Query
res p
b lob
ser ve
sm all
æ Į
Ġfor ce
rad ius
ĠGener al
Bound s
map s
Ġ ĉ
Ġweight s
f lex
ers ist
M emory
ĠCont ext
ĠP age
or igin
Act iv
Ġ angle
remove Class
ĠT ask
Ġload ing
Ġh istory
Ġre ct
d y
st ock
Ġis s
Ġind ices
ç ¬
Ġ lower
Ġp e
B L
S end
art icle
sub ject
n able
F ocus
_ {
= %
Ġwh at
Ġr s
ĠE lement
N N
Ġf low
Ġact ivity
per ature
ĠInt ent
åŃ ĺ
exp and
The me
m c
ach ment
Group s
Ġexec ution
pre vent
define Property
C R
Ġac c
G ui
V O
T ipo
I I
ud ing
Ġal t
Ġ[ (
T y
c n
D OM
P acket
av g
' "
nd array
] }
Ċĉĉĉ Ċĉĉ
Ġmatch es
Ġo perations
TI VE
road cast
J oin
ĠE ntity
åĢ ¼
wj gl
Ġdistrib ution
åĪ °
aly t
d ic
cy cl
ab c
ĠU SE
S napshot
br anch
ç ¤
F IL
one y
se mb
å ī
C opy
s lf
$ /
ud y
Ġz ero
ST ATE
IMPORT ED
ĠAp i
ex cept
per cent
ĠS H
j et
av el
bin ary
m argin
ĥ ½
ser ies
Ġro uter
Suppress Warnings
ĠI MP
Ġan other
ight s
pi pe
Id entity
ac le
Ġc alculate
Ġb in
th rift
UL AR
H and
Ac cept
Ġper iod
Ġrece ived
] ["
S L
Ġid entifier
variable s
elastic search
m em
l im
X Y
Up load
To uch
log ic
: ",
Ġm ouse
éĹ ´
pe ated
sc hedule
h ot
Ġcont act
ĠCreate d
is on
Ġl ibrary
Con sumer
Ġch ain
Ġgroup s
Ġmet ric
t ol
bound s
= \
se gment
h ing
Ġt eam
j av
il ar
D ig
ĠB e
Class Name
N U
Ġplace holder
Ġpl atform
( ",
select or
Ġf it
ob ile
Ġen sure
de cor
parse Int
Ġse q
({ "
ul a
for ward
Ġne g
ç Ĥ
NotFound Exception
AG ES
Ġtop ic
W ord
ĠD ocument
se g
ue st
ob s
ation al
T uple
v en
Ġent ries
dum ps
Ġre ason
Ġ" @
ĊĠĠĠĠĠĠĠĠ ĊĠĠĠ
ed ges
P ower
ĠB uild
åı ¯
Menu Item
res ize
Column s
then Return
Ġt ick
st ar
Ġc ould
Ġ{} ".
Collection s
Vis ibility
Ġmet rics
v s
f il
ĠL ine
I F
in cip
B us
Ch ain
dest roy
Ġ append
I p
p in
ur ch
Z one
fer ences
ĠEx ec
ĠS tr
Ġde code
De pend
jack son
T imer
m id
ad a
S lot
class List
Ġro und
Ġ( $
Ġu uid
w atch
N ESS
Ġv ol
åĬ ł
ĠS E
ent ities
get User
f ree
ri p
Ġint ent
¦ ģ
Ġd er
b ias
R et
ĠOut put
Ġres ources
== =
Ġon Change
C enter
Format ter
ver bose
Implement ed
================================ ================================
co ur
Ġd ig
B asic
p d
E MP
Ġlo aded
In ject
. '
d ump
(" -
PO SE
res ses
update d
CO MM
om eth
Ġpred iction
CO UNT
Ġser ial
db c
u et
Names pace
ESS AGE
b c
Ġcur r
y aml
LO CK
Pre sent
Ġtr ace
è® ¾
ĠV ector
ot es
Ġare a
um my
Group Layout
ĠWh en
not e
Ġw ords
and s
ometh ing
aw n
Ġo k
Ġunit test
g reen
| ;
ement s
ĠG raph
ĠTo ken
Ġre covered
P ublic
Ġm edia
Ġl ang
Error s
rel u
Ġal ways
ç Ĳ
ĠP O
Ġre verse
is ode
æĸ °
Ġup load
O pt
j a
OL DER
ST ART
p id
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
Ġb ook
ĠM IT
vo ice
Ġhas attr
p at
L Y
lo ur
k s
d i
R ot
Ġrule s
Ġd uring
Rem ote
Row s
Ġde aths
h ook
k ind
t i
Ġn ested
Ġn eeded
Ġv olume
reg ex
ĠL IM
S m
Ġ_ ,
av ing
get Property
Fore ignKey
Ġparse Int
esc ape
W I
å ¹
is c
R aises
çĤ ¹
Ġc ar
Access or
Ġw ay
ĠLIM IT
Cur sor
Ġincid ents
we et
Stat ic
is her
Ġd s
re pr
um an
R aw
ç¤ º
velo p
) "
voc ation
CL ASS
get Default
Gener al
é ¢
ĠM ain
id entity
Ġc n
Ġincl uded
ad line
REQU EST
Ġw ould
mo st
r pc
Ġcomponent s
ĠX ML
a N
ĠD esc
method s
AC TION
Ġ" ../
od ay
RE CT
s lide
ic o
| (
Ġcom plete
ĠW ork
Ġpro xy
Vert ex
ĠM et
ĠSe arch
Ñģ ÑĤ
Ġfl ags
red irect
al ity
Ġf oo
as List
V olume
ĠAt tribute
Ġf eed
Ġde s
v ance
ĠC l
Ġdis abled
Ġ ];
co untry
Ġload er
æŀ ľ
s r
Sp an
Ð ¿
An gle
Ġre pository
F ixed
Ġ" ")
O wner
__ ":
Ġ engine
Ġe val
look up
Ġnot ification
> ',
get Attribute
M AP
re et
f aster
et ter
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġcommand s
match es
ut ors
lib rary
æĸ ¹
d en
( **
ĠCre ates
Ġuser Id
ĠB UT
LO AD
us ic
Al low
Ġpred ict
ion es
Ġinter val
Fail ure
f eat
back end
ĠRuntime Exception
j ax
ateg or
ch oice
al ias
Ġdef inition
çĲ Ĩ
ĠB E
AT OR
b us
åĪ Ĺ
ĠW HERE
er c
not ations
dim s
Im g
ener gy
DE BUG
pe ar
æ ±
åį ķ
assert Raises
čĊ čĊĠĠĠĠĠĠĠĠĠĠĠ
Ġstr ings
Ġcomp are
set ter
ĠO UT
p ay
Ġproto col
Top ic
Expect ed
í ķ
a u
ĠM od
de g
=" /
M IT
r atio
Ġor igin
Ġc alcul
w r
in itions
G u
on d
S A
b ul
ĠCon stant
b n
prevent Default
Ġo cc
l iteral
Ġre moved
I B
M ask
ãģ Ĺ
hash Code
iver s
\ .
Ġget attr
Sw itch
S heet
opt im
Ġlay ers
Ġdest ination
arch ive
Ġp andas
pro gram
h ist
incip al
Ġth reshold
k t
m esh
Ġ ))
UT F
get Time
Ġ ])
N ative
ĊĊ ĊĠ
S peed
function s
CH ANT
umer ic
el li
Ar ch
Ġ low
Ġh y
form s
Ġm d
St andard
fr ames
apt ion
è¿ Ķ
uplic ate
Ġnot e
On ClickListener
LI ED
user Id
he el
Rel ation
t im
cycl er
' {
Re act
WOR D
A lert
config ure
ä¿¡ æģ¯
M T
UR POSE
get Item
Loc ale
C ar
c lip
Text View
unk nown
Ġspec ify
D iff
Ġn orm
åĩ º
rupt ed
ge o
INST ANCE
ĠC O
Ġe ffect
L ight
ä¸ ĭ
t le
ĠM ER
b um
B Y
not ification
assert False
Ġ ^
Ġset Up
IT NESS
] ])
if ies
link s
Ġ} ));
c nt
Ġuse State
L Object
as y
faster xml
v es
F ER
Ġ> >
Ã £
s aved
Ġstate ment
ard ing
ĠA uto
se p
Ġcol ors
block s
IG HT
Ch unk
include s
Per iod
Ġrel ated
Ġb ucket
ĠM edia
ĠO N
th at
č Ċĉĉĉĉĉĉ
c alc
Ġfilter s
P H
Ġs ol
Ġmat plotlib
ĠF I
b le
ĠPAR TIC
Al ign
Ġex c
g ui
D om
ĠS up
N e
Ġde lay
Ġnum bers
Can vas
ad apter
` );
Ġg oogle
Ġsub process
H igh
K EN
D IS
Ġro om
ĠT ree
I LED
M issing
Ġstyle s
ç º
é Ŀ
+ =
Ġgener ator
c ert
str ong
ch anged
Ġin ner
ĠL ay
Av ailable
ĠC OP
Ġview s
ed List
med iate
ENG TH
ĠP URPOSE
b alance
ut down
Ġdepend encies
Sum mary
ate st
D irect
let te
Ex tra
Dist ance
Ġ% (
Ġv e
CHANT ABILITY
Ñ ĩ
Ġset Timeout
Ġselect or
Re al
if e
Ġ answer
ĠN ew
File Name
af ka
Ġc ost
M er
Ġbl ank
T eam
Ex port
im ated
ent ries
Ġp ipeline
c up
cat alog
anag ed
Ġbr anch
ĠPARTIC ULAR
Ġrad ius
ap es
={ "
To String
ä ¾
struct ure
Ex ists
ĠCh ar
F etch
ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Ġw x
ubl ished
Rad ius
t c
Ġcontent s
Ġm aterial
D rag
r type
Cl asses
Ġchar acters
Http Servlet
c lo
åĲ ¦
ĠI P
å İ
) ])
Ġse ns
! ");
Ġp s
Instance State
B ED
Ġs peed
j up
ĠCOP Y
enc oder
sign ed
ĠIm port
Ġsynchron ized
graph ics
get Data
Ġc r
h ave
Ex ist
Draw able
m ing
Ġev en
fo ot
SU CCESS
- >
W ait
Ġf a
Ġc ause
Block ly
čĊč ĊĠ
"> <
/ %
S o
AM P
t imer
ut ing
Dis patch
Ġle g
Widget s
en ario
ĠO b
over age
č ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Sign ature
Ġdim ension
ĠPro cess
Ġde scriptor
A ST
En able
se ct
Text ure
Byte String
Ġg u
ĠMER CHANTABILITY
Ġa udio
ł ģ
Ġopt im
F eed
id entifier
. </
Ġde clare
ĠS ource
Ch at
Json Property
" \
G RO
} '.
p us
or n
Ġj s
ust ers
ench mark
fr ont
Ġf ire
čĊĠĠĠĠ čĊĠĠĠ
ers hip
FL AG
comp any
ik ari
Ġ' [
sh are
ĠSt art
ç ®
(" --
Content s
è ¦ģ
Ġcall s
ĠRe ad
ĠW H
ä¸ Ĭ
Not e
imul ation
ri end
ĠD AM
M B
ro bot
Ġab solute
st age
inte gr
STAT US
c amera
se ss
M ixin
Ġt ake
Ġch art
Ġhel per
j Query
z en
log s
f req
p an
ex c
oot h
D ESC
: .
w rit
pe g
Ġk ind
s By
Ġinst ances
re verse
late st
in herit
An y
c redentials
i h
Ġde ployment
Trans ition
Ġv ia
Ġ -------
() ]
Ġb oard
po und
ect ors
c urrency
in ject
Ġsample s
ĠF ITNESS
OR E
has OwnProperty
end or
ref s
ĠS pec
de mo
que e
ÑĢ Ð°
LO C
. <
ĠIMP LIED
Ġd st
L en
Ġcon straint
L at
} ".
boot strap
l on
Ġat om
C LI
Ġde leted
g ers
ãĥ ¼
s pe
"] [
sort ed
Ġmodule s
è¿Ķ åĽŀ
DE F
é Ķ
L ook
Ġbound s
qu ential
ãĢ ģ
Con n
G N
sl ug
Ġneed s
âĸĪ âĸĪ
Ġbe low
prev ious
an ded
- .
ĠLIMIT ED
Ġser ies
ur a
Ġm any
) +
t wo
åī į
ash board
uet ooth
ãĤ ĵ
a res
He ad
ubl isher
s quare
list ener
g uild
Ġsp an
asc ript
Ġde c
pred iction
ĠApp lication
alyt ics
Argument s
in ator
is EqualTo
M any
Ġstore d
ar row
A IL
default s
r m
St age
Data Type
R oom
ĠE VENT
C D
Ċ Ċĉĉĉĉ
| )
Ġp acket
Ġh ome
urch ase
c am
as is
TO KEN
Pointer Exception
' re
> ",
Ġopt imizer
ar ange
Ġstat es
Ġover ride
Tr igger
Ġcol lect
ĠIn valid
M ESSAGE
b ig
ampl ing
Ġc ancel
Ġre po
Ġpart s
= _
ie ce
c art
t p
L ENGTH
åĲ İ
( ["
v irtual
Ex ternal
UR CE
Ph one
re gistry
Ġre lease
ĠPro perty
Ġcop ies
Ã §
content s
çĶ¨ æĪ·
ĠR andom
er ic
ĠArray s
Ġsum mary
as set
Ġsc hedule
S plit
E MA
Ġc amera
[] {
part s
ĠS w
Ġ ĊĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
i ance
Tem p
Us age
Ob server
Ġtask s
e a
ro ker
Ã£ o
ĊĠĠĠĠ ĉ
P lease
u lo
(" [
ĠSt ream
Ð¾Ð ²
Com bo
.... ....
ĠConfig uration
greg ate
Ġcollection s
Ġp romise
co ords
sc an
VID ED
o ugh
Ġm oment
Ġst andard
draw able
be an
Ġcurrent ly
fix ture
A udio
Ġm ost
Ġh ar
velop ment
ame l
HE AD
st er
Ð ·
Ġf ragment
il li
render er
n io
s ame
Ġsign al
t ty
po sed
Ġl on
se l
m embers
Ġun its
app s
ĠStat us
ĠT uple
Ġf ake
n r
hel lo
æİ ¥
st it
Sc ene
ĠP er
in u
å¼ ı
DE X
ward s
P ayload
ĠM ake
PR ESS
Ġm s
ĠS ec
Ġp ublish
ING S
/ ${
En coder
ĠD O
'] ;
m issing
ge ometry
æ³ ķ
ĠCOPY RIGHT
d rag
in o
ON G
E mbed
Ġl ater
å ŀ
& &
v l
Ġme asure
not ify
main ing
ĠS to
ĠLOG GER
è ·
ĠAr g
C amera
RE E
æł ĩ
Ġa ff
U ST
åĬ ¡
Ġf actor
Sub ject
lic it
am age
id ent
Ġm ult
ĠHT ML
b i
S pring
[ (
ĠG NU
ĠH el
ĠÐ ²
in a
Ġtest ing
¦ Ĥ
og ram
Ġw in
E nt
ip y
ĠNot Implemented
un ct
ĠEx p
Init ial
Th row
Ġrel ation
find ViewById
Ġref resh
on ce
Ġcorrespon ding
Author ization
Ġstyle d
Ġ' +
ĠB l
ot ype
Ġ( -
åı Ĥ
ç łģ
ict ure
jup iter
ong oose
S M
ĠL abel
Id x
Ġsub mit
able s
Gener ic
C loud
Ġc redentials
Ġvar iant
s f
p ic
Ġs yn
ĠD ec
ĠD et
s ym
Ġmark er
ch o
ant ed
æĸĩ ä»¶
} ',
Ġp oly
L ines
ĠUn ion
P references
Ġon ce
PAR AM
Ġ{} '.
Ġn one
ER S
Del ay
Ġre d
sub scribe
an alysis
ĠU I
Met ric
Ġst eps
Path s
ĠM eta
Ġab s
tr l
Ġind ic
j avax
irc uit
ext ernal
ĠF ilter
st ub
}` );
} ')
run ning
As set
V M
Ø §
++ ++
Ġs ync
u pt
Ġsh ared
M iddleware
Up per
Ġcon struct
ĠG ame
c he
HO ST
Ġr ank
fl at
Ġg re
Ġb g
t l
g ulp
ot a
In sert
Ġ question
pre pare
Component s
M ar
cook ie
fl ater
Ġpart ition
O O
Ġup per
