{
  "add_prefix_space": false,
  "bos_token": "<|endoftext|>",
  "eos_token": "<|endoftext|>",
  "errors": "replace",
  "model_max_length": 2048,
  "name_or_path": "bigcode/santacoder",
  "special_tokens_map_file": "/home/ubuntu/.cache/huggingface/hub/models--bigcode--santacoder/snapshots/132eb6b6cedaf579c2f333f1ecd78a16d7e45978/special_tokens_map.json",
  "tokenizer_class": "GPT2Tokenizer",
  "unk_token": "<|endoftext|>"
}
